In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import re

In [2]:
df = pd.read_csv(r"C:\Users\sdas\Github_DS\Multi_Index_Pandas_Functions\train.csv")
print (df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

## 1. Groupby

### 1.1 Single index

In [3]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').count()
df_groupby_sex

        Fare
Sex
female   314
male     577

In [4]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').mean()
df_groupby_sex

             Fare
Sex
female  44.479818
male    25.523893

In [5]:
def square(x):
    sq = x*x
    return sq

In [7]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').apply(square)
df_groupby_sex

            Fare
0      52.562500
1    5081.308859
2      62.805625
3    2819.610000
4      64.802500
..           ...
886   169.000000
887   900.000000
888   549.902500
889   900.000000
890    60.062500

[891 rows x 1 columns]

In [4]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').describe()
df_groupby_sex

         Fare
        count       mean        std   min        25%   50%    75%       max
Sex
female  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00  512.3292
male    577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55  512.3292

In [13]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').agg(['count','mean','median','std','max','min'])
df_groupby_sex

        Fare
       count       mean median        std       max   min
Sex
female   314  44.479818   23.0  57.997698  512.3292  6.75
male     577  25.523893   10.5  43.138263  512.3292  0.00

### 1.2 Multi-index

In [18]:
df_groupby_parch_sex = df[['Parch','Sex','Fare']].groupby(['Parch','Sex']).agg(['count','mean'])
df_groupby_parch_sex

              Fare
             count        mean
Parch Sex
0     female   194   39.826591
      male     484   19.879078
1     female    60   46.987292
      male      58   46.561857
2     female    49   63.231292
      male      31   66.086290
3     female     4   23.845825
      male       1   34.375000
4     female     2   24.487500
      male       2  145.450000
5     female     4   32.868750
      male       1   31.275000
6     female     1   46.900000

### 1.1 Unstacks

In [26]:
df_groupby_sex = df[['Sex','Fare']].groupby('Sex').describe()
df_groupby_sex

         Fare
        count       mean        std   min        25%   50%    75%       max
Sex
female  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00  512.3292
male    577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55  512.3292

In [27]:
df_groupby_sex.unstack()

             Sex
Fare  count  female    314.000000
             male      577.000000
      mean   female     44.479818
             male       25.523893
      std    female     57.997698
             male       43.138263
      min    female      6.750000
             male        0.000000
      25%    female     12.071875
             male        7.895800
      50%    female     23.000000
             male       10.500000
      75%    female     55.000000
             male       26.550000
      max    female    512.329200
             male      512.329200
dtype: float64

In [28]:
df_groupby_sex.unstack().unstack()

Sex             female        male
Fare count  314.000000  577.000000
     mean    44.479818   25.523893
     std     57.997698   43.138263
     min      6.750000    0.000000
     25%     12.071875    7.895800
     50%     23.000000   10.500000
     75%     55.000000   26.550000
     max    512.329200  512.329200

In [29]:
df_groupby_sex.unstack().unstack().unstack()

Sex  female                                                               \
      count       mean        std   min        25%   50%   75%       max
Fare  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.0  512.3292

Sex    male
      count       mean        std  min     25%   50%    75%       max
Fare  577.0  25.523893  43.138263  0.0  7.8958  10.5  26.55  512.3292

## 2. Unstack with multi-index

In [22]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [23]:
df['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6], dtype=int64)

In [24]:
df['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [30]:
df_groupby_parch_sex = df[['Parch','Sex','Fare']].groupby(['Parch','Sex']).count()
df_groupby_parch_sex

              Fare
Parch Sex
0     female   194
      male     484
1     female    60
      male      58
2     female    49
      male      31
3     female     4
      male       1
4     female     2
      male       2
5     female     4
      male       1
6     female     1

In [31]:
df_groupby_parch_sex.unstack()

        Fare
Sex   female   male
Parch
0      194.0  484.0
1       60.0   58.0
2       49.0   31.0
3        4.0    1.0
4        2.0    2.0
5        4.0    1.0
6        1.0    NaN

In [32]:
df_groupby_parch_sex.unstack().unstack()

      Sex     Parch
Fare  female  0        194.0
              1         60.0
              2         49.0
              3          4.0
              4          2.0
              5          4.0
              6          1.0
      male    0        484.0
              1         58.0
              2         31.0
              3          1.0
              4          2.0
              5          1.0
              6          NaN
dtype: float64

In [33]:
df_groupby_parch_sex.unstack().unstack().unstack()

Parch            0     1     2    3    4    5    6
     Sex
Fare female  194.0  60.0  49.0  4.0  2.0  4.0  1.0
     male    484.0  58.0  31.0  1.0  2.0  1.0  NaN

In [34]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack()

Parch      0             1            2            3           4           5  \
Sex   female   male female  male female  male female male female male female
Fare   194.0  484.0   60.0  58.0   49.0  31.0    4.0  1.0    2.0  2.0    4.0

Parch           6
Sex   male female male
Fare   1.0    1.0  NaN

In [35]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack().unstack()

Parch  Sex
0      female  Fare    194.0
       male    Fare    484.0
1      female  Fare     60.0
       male    Fare     58.0
2      female  Fare     49.0
       male    Fare     31.0
3      female  Fare      4.0
       male    Fare      1.0
4      female  Fare      2.0
       male    Fare      2.0
5      female  Fare      4.0
       male    Fare      1.0
6      female  Fare      1.0
       male    Fare      NaN
dtype: float64

In [36]:
df_groupby_parch_sex.unstack().unstack().unstack().unstack().unstack().unstack()

               Fare
Parch Sex
0     female  194.0
      male    484.0
1     female   60.0
      male     58.0
2     female   49.0
      male     31.0
3     female    4.0
      male      1.0
4     female    2.0
      male      2.0
5     female    4.0
      male      1.0
6     female    1.0
      male      NaN

# 3. Multi-index indexing

In [37]:
df_groupby_parch_sex

              Fare
Parch Sex
0     female   194
      male     484
1     female    60
      male      58
2     female    49
      male      31
3     female     4
      male       1
4     female     2
      male       2
5     female     4
      male       1
6     female     1

In [38]:
df_groupby_parch_sex.loc[1,'male']

Fare    58
Name: (1, male), dtype: int64

In [39]:
df_groupby_parch_sex.iloc[1]

Fare    484
Name: (0, male), dtype: int64

# 4. Melt

In [40]:
#melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)
df_melt = pd.melt(df,id_vars='Name',value_vars='Fare')
df_melt.head(10)

                                                Name variable    value
0                            Braund, Mr. Owen Harris     Fare   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Fare  71.2833
2                             Heikkinen, Miss. Laina     Fare   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Fare  53.1000
4                           Allen, Mr. William Henry     Fare   8.0500
5                                   Moran, Mr. James     Fare   8.4583
6                            McCarthy, Mr. Timothy J     Fare  51.8625
7                     Palsson, Master. Gosta Leonard     Fare  21.0750
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Fare  11.1333
9                Nasser, Mrs. Nicholas (Adele Achem)     Fare  30.0708

In [41]:
pd.melt(df,id_vars='Name',value_vars=['Sex','Parch']).head(10)

                                                Name variable   value
0                            Braund, Mr. Owen Harris      Sex    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      Sex  female
2                             Heikkinen, Miss. Laina      Sex  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      Sex  female
4                           Allen, Mr. William Henry      Sex    male
5                                   Moran, Mr. James      Sex    male
6                            McCarthy, Mr. Timothy J      Sex    male
7                     Palsson, Master. Gosta Leonard      Sex    male
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      Sex  female
9                Nasser, Mrs. Nicholas (Adele Achem)      Sex  female

# 5. Pivot Table

In [42]:
df_melt.head()

                                                Name variable    value
0                            Braund, Mr. Owen Harris     Fare   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Fare  71.2833
2                             Heikkinen, Miss. Laina     Fare   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Fare  53.1000
4                           Allen, Mr. William Henry     Fare   8.0500

In [43]:
#pivot(data, index=None, columns=None, values=None)
df_melt.pivot(index='Name', columns='variable', values='value').head(10)

variable                                           Fare
Name
Abbing, Mr. Anthony                              7.5500
Abbott, Mr. Rossmore Edward                     20.2500
Abbott, Mrs. Stanton (Rosa Hunt)                20.2500
Abelson, Mr. Samuel                             24.0000
Abelson, Mrs. Samuel (Hannah Wizosky)           24.0000
Adahl, Mr. Mauritz Nils Martin                   7.2500
Adams, Mr. John                                  8.0500
Ahlin, Mrs. Johan (Johanna Persdotter Larsson)   9.4750
Aks, Mrs. Sam (Leah Rosen)                       9.3500
Albimona, Mr. Nassef Cassem                     18.7875